---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.Assign(Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings)
zh: 赋值、设置值、写入
source: html/1fc2a29d-9edb-a68c-c2f2-10fd2dd93374.htm
---
# Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.Assign Method

**中文**: 赋值、设置值、写入

Assigns values of the source settings to this object.

## Syntax (C#)
```csharp
public void Assign(
	DirectContext3DHandleSettings other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings`) - The source settings.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null